#pragma once
#include "CLibEventData.h"
#include "LibUserFunction.h"
#include <map>
using namespace std;

class CLibEventFunction
{
public:
	CLibEventFunction(void);
	~CLibEventFunction(void);
public:	
	/************************************************************************/
	/* 注册业务处理函数                                                     */
	/************************************************************************/
	static void RegistFunc(int id, lpFunPtr func);
	/************************************************************************/
	/* 注册接受客户端连接时响应函数                                         */
	/************************************************************************/
	static void RegistConnectedFunc(lpFunPtr func);
	/************************************************************************/
	/* 注册客户端断开处理函数                                               */
	/************************************************************************/
	static void RegistDisconnectedFunc(lpFunPtr func);
	/************************************************************************/
	/* 注册网络超时处理函数                                                 */
	/************************************************************************/
	static void RegistTimeoutFunc(lpFunPtr func);
	/************************************************************************/
	/* 注册客户端连接关闭处理函数                                           */
	/************************************************************************/
	static void RegistClosedFunc(lpFunPtr func);
	/************************************************************************/
	/* 注册网络错误处理函数                                                 */
	/************************************************************************/
	static void RegistErrorFunc(lpFunPtr func);
	/************************************************************************/
	/* 注册用户自定义头部的同步密码                                         */
	/************************************************************************/
	static void RegistStx(int stx);
	/************************************************************************/
	/* 注册用户自定义头部的同步密码                                         */
	/************************************************************************/
	static int LoadStx();
public:	
	static int DispatchFunction(int nFunID,Conn*pItem);
private:
	static lpFunPtr m_FunPtrList[emMaxPackageType];
	static int m_stx;
};

